{
    "experiences":[{
            "title": "Software Developer",
            "company": "medisite GmbH, Hannover, Germany.",
            "duration": "03/2017–Present ",
            "description": [
                {"paragraph": "Developing Web based Frontend application for the medical and pharmaceutical sector"},
                {"paragraph": "Involved in design and implemention of REST API for the frontend application using Java EE Technologies. "}

            ], 
            "technologies": "Angular 5+, Bootstrap 4, HTML, CSS, JQuery, JS, Jenkins, WildFly, Docker (basic), JavaEE (Spring, JPA, JAX-RS, Maven), Scrum, JIRA, Conﬂuence, Git "
        },
        {
            "title": "Software Developer",
            "company": "KonVis – Visionäre Konzepte GbR, Hannover, Germany",
            "duration": "05/2016–10/2016 ",
            "description": [
                {"paragraph": "Worked with Agile team of three members"},
                {"paragraph": "Designed and implemented REST API for Mobile Apps"},
                {"paragraph": "Developed a responsive web application for functional testing of the REST API."}
            ], 
            "technologies": "Angular, HTML5, CSS, JQuery, JavaScript, Java, Spring, JAX-RS, Hibernate, Maven, Mockito, JUnit, Git and MySQL"
        },
        {
            "title": "Student Assistant",
            "company": "ayeT-Studios GmbH, Hannover, Germany",
            "duration": "06/2015–12/2015 ",
            "description": [
                {"paragraph": "Implemented a reseller platform (https://www.ayetstudios.com/reseller) for ayet-Studios which is a white-label web application and developed for SEO agencies or diﬀerent resellers to conduct user acquisition promotions by driving app install campaigns. "}
            ], 
            "technologies": " CakePHP 3 Framework, PHP, MySQL, AJAX, JQuery, JavaScript, Bootstrap, Apache, Agile Methodology, JIRA and Git"
        }
        
    ],
    "educations": [{
            "degree": "M.Sc.",
            "fieldOfStudy": "M.Sc. in Internet Technologies & Information Systems",
            "university": "Leibniz Universität Hannover, Germany ",
            "duration": "2012–2015"
        },
        {
            "degree": "Master",
            "fieldOfStudy": "Master in Information Technology",
            "university": "University of Dhaka, Bangladesh ",
            "duration": "2008–2009 "
        },
        {
            "degree": "PGDip",
            "fieldOfStudy": "PGDip in Information & Communication Technology",
            "university": "Bangladesh University of Engineering and Technology, Bangladesh",
            "duration": "2007–2009"
        },
        {
            "degree": "B.Sc.",
            "fieldOfStudy": "B.Sc. in Computer Science & Engineering",
            "university": "Stamford University Bangladesh ",
            "duration": "2002–2006"
        }
    ],
    "skills":[
       {
          "label": "Angular, JavaScript",
          "value": 35
        },
        {
          "label": "Java",
          "value": 40
        },
        {
          "label": "PHP",
          "value": 20
        },
        {
          "label": "Android",
          "value": 10
        }
    ]
    ,
    "projects":[{
            "name": "Analysis tool for document annotation, analysis and enrichment in qualitative archives",
            "description": "The goal of this project is to enable intelligent access to qualitative data gathered from diverse sociological studies regarding the workplace. The analysis of the content of social sciences has been an important concern. This kind of analysis typically relies on coding of the text, annotating or give comments on the text, and this can limits the sizes of the corpora that can be analyzed for secondary research. Such kind of analysis tool developed in this project to help the social scientist to re-use the important qualitative data for their secondary research. I designed, implemented and tested the analysis tool under supervision of 'Gute-Arbeit' project team of L3S research Center",
             "imageUrl": "http://khaledansary.com/wp-content/uploads/2017/01/research-project-2.png",
            "technologies": "JSF, Primefaces, Hibernate, JavaScript, XML, JAXB, REST (Jersey/JAX-RS), Stanford CoreNLP, Netbeans IDE and MySQL. "
        },
        {
            "name": "Reseller Platform for AyetStudios",
            "description": "AyeT-Studios specialized in Play Store promotion and advertising as well as mobile application and web development. I was responsible to develop a reseller platform for AyeT-Studios. The reseller platform is a web application and developed for SEO agencies or who has clients that request Play Store Promotion or Play Store app installs from safe & genuine sources. ",
            "imageUrl": "http://khaledansary.com/wp-content/uploads/2017/01/ayet-project.jpg",
            "technologies": "The web application developed by CakePHP 3 Framework, PHP, MySQL, Ajax, Jquery, JSON, Bootstrap, and Apache"
        },
        {
            "name": "Data acquisition System of Dhaka Electric Supply Company, Dhaka, Bangladesh",
            "description": "It is a real time desktop based visualization tool of Data acquisition System of Dhaka Electric Supply Company. I was a development and maintenance team member of this system.",
            "imageUrl": "http://khaledansary.com/wp-content/uploads/2017/01/das-project-4.png",
            "technologies": "The web application developed by CakePHP 3 Framework, PHP, MySQL, Ajax, Jquery, JSON, Bootstrap, and Apache"
        },
        {
            "name": "Aysha's Food Recipe (Android Mobile Application)",
            "description": "I developed a food recipe app named 'Aysha's Food Recipe' as well as the Backend REST API and Recipe Management web application. ",
            "imageUrl": "http://khaledansary.com/wp-content/uploads/2017/01/device-2017-01-02-145928-min.png",
            "technologies": "Java, Android, Android Studio, REST API and MySQL"
        }
    ]
}